# Brewfile

# taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"

# CLI tools
brew "tree"
brew "ripgrep"
brew "fzf"
brew "lsd"
brew "tmux"
brew "node"
brew "npm"
brew "mysql"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "fish"

# Dev tools
brew "git"
brew "neovim"

# Cask apps
cask "iterm2"
cask "visual-studio-code"
cask "github"
cask "brave-browser"
cask "google-chrome"
cask "alfred"
cask "itsycal"
cask "transmission"
cask "balenaetcher"
cask "keka"
cask "anydesk"
cask "microsoft-defender"
cask "ollama"
